[{"title":"Pokemon Fellows","date":"4.17.17","img":"assets/pokemon-fellows-pic.png","link":"http://pokemonfellows.com","description":"This is my most recent group project. It uses some advanced socket.io and javascript, but my biggest contribution was towards the CSS and UX aspect. This is all done with vanilla CSS. It is a pokemon battle app that was designed as mobile fist and showcases all of our relevant skills up to this point. But again, I was in charge of all of the CSS. It still needs better SMACKS organization, but the project had to be completed in 3 days so the CSS still has some disorganization.","contributors":"Saul Greene, Ely Pasinger, Michael Piaget, Cameron Bacon"}, {"title":"Escape code 201","date":"3.17.17","img":"assets/escapeCodePic.png","link":"https://michaeltreat.github.io/Escape-code-201/","description":"This was the final project for one of my classes at 4 weeks and it uses all of the skills learned. The important ones being local storage persistence, CSS, Chrome Dev Tools, and all of the skills included in all prior projects. The goal of this browser game is to make it to the last level using the dev tools to help you make it through. This game is designed for those with prior dev exp[erience. Have a go if you like, but the last level is almost impossible without instruction! Good luck.","contributors":"Saul Greene, Michael Treat, Carlo Santos, Kevin Schmidt"},{"title":"Bus Mall","img":"assets/busMallPic.png","description":"This was one of my projects in week 2. Here we didnt focus as much on HTML/CSS as we did JS functionality. This page prompts you to click your favorite product at which point it will prompt you 25 more times. After 25 selections you are presented with the popularity of the products based on clicks as a percentage of the times the picture was shown since the program populkates 3 random images without immediate repeats. This is displayed nicely with ChartsJS and keeps a running tally/average of everyiones votes (only uses local storage).","date":"2.20.17","contributors":"Saul Greene","link":"https://saulgreene.github.io/bus-mall/"},
{"title":"About Saul","img":"assets/aboutMe.png","description":"This was my first ever webpage. USing only HTML, CSS, and VanillaJS it gives some info about me and there is a quiz embedded which shows where I started.","date":"2.14.17","contributors":"Saul Greene","link":"https://saulgreene.github.io/About-Me/"}]
